Revit 2026 API

# ParameterFilterElementGetElementFilterParametersForCategory Method

---

Retrieves a list of the parameters associated with all rules in the filter that are combined (using logical AND) with a FilterCategoryRule corresponding to single %categoryId%.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public ISet<ElementId> GetElementFilterParametersForCategory(
	ElementId categoryId
)
```
```vb
Public Function GetElementFilterParametersForCategory (
	categoryId As ElementId
) As ISet(Of ElementId)
```
```cpp
public:
ISet<ElementId^>^ GetElementFilterParametersForCategory(
	ElementId^ categoryId
)
```
```fsharp
member GetElementFilterParametersForCategory :
        categoryId : ElementId -> ISet<ElementId>
```

#### Parameters

categoryId ElementId
     The category for which parameters should be found.

#### Return Value

ISetElementId A set of parameter identifiers.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

Note that in the case when InvalidElementId specified as input %categoryId% this function returns parameters common to all categories used by this ParameterFilterElement, i.e. it is equivalent to ParameterFilterElement.GetElementFilterParameters().

#### Reference

ParameterFilterElement Class

Autodesk.Revit.DB Namespace